airgrzybek/FreeRTOS/FreeRTOS/Common/drivers/ST/STM32F10x_StdPeriph_Lib_V3.5.0/CMSIS/CM3/DeviceSupport/ST/STM32F10x/startup/gcc_FreeRTOS/startup_stm32f10x_cl_v2.c
/**
 * @file      startup_stm32f10x_md.c
 * @author    Stefano Oliveri (software@stf12.net)
 * @version   V3.1.0
 * @date      22/06/2009
 * @brief     STM32F10x High Density Devices vector table for GCC toolchain.
 *            This module performs:
 *                - Set the initial SP
 *                - Set the initial PC == Reset_Handler,
 *                - Set the vector table entries with the exceptions ISR address,
 *                - Configure external SRAM mounted on STM3210E-EVAL board
 *                  to be used as data memory (optional, to be enabled by user)
 *                - Branches to main in the C library (which eventually
 *                  calls main()).
 *            After Reset the Cortex-M3 processor is in Thread mode,
 *            priority is Privileged, and the Stack is set to Main.
 * @attention modified the vector table and the Reset_Handler to use
 *            the demo with eclipse and GCC and to provide support for the
 *            newlib C runtime library.
 *            Modified by Stefano Oliveri (software@stf12.net)
 *******************************************************************************
 * @copy
 *
 * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING USERS
 * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
 * TIME. AS A RESULT, STEFANO OLIVERI SHALL NOT BE HELD LIABLE FOR ANY
 * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
 * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
 * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
 *
 * <h2><center>&copy; COPYRIGHT 2009 Stefano Oliveri</center></h2>
 */

#define WEAK __attribute__ ((weak))

/* Includes ----------------------------------------------------------------------*/

void WEAK Reset_Handler(void);
void WEAK NMI_Handler(void);
void WEAK HardFault_Handler(void);
void WEAK MemManage_Handler(void);
void WEAK BusFault_Handler(void);
void WEAK UsageFault_Handler(void);
void WEAK MemManage_Handler(void);
void WEAK SVC_Handler(void);
void WEAK DebugMon_Handler(void);
void WEAK PendSV_Handler(void);
void WEAK SysTick_Handler(void);

/* External Interrupts */
void WEAK WWDG_IRQHandler(void);
void WEAK PVD_IRQHandler(void);
void WEAK TAMPER_IRQHandler(void);
void WEAK RTC_IRQHandler(void);
void WEAK FLASH_IRQHandler(void);
void WEAK RCC_IRQHandler(void);
void WEAK EXTI0_IRQHandler(void);
void WEAK EXTI1_IRQHandler(void);
void WEAK EXTI2_IRQHandler(void);
void WEAK EXTI3_IRQHandler(void);
void WEAK EXTI4_IRQHandler(void);
void WEAK DMA1_Channel1_IRQHandler(void);
void WEAK DMA1_Channel2_IRQHandler(void);
void WEAK DMA1_Channel3_IRQHandler(void);
void WEAK DMA1_Channel4_IRQHandler(void);
void WEAK DMA1_Channel5_IRQHandler(void);
void WEAK DMA1_Channel6_IRQHandler(void);
void WEAK DMA1_Channel7_IRQHandler(void);
void WEAK ADC1_2_IRQHandler(void);
void WEAK USB_HP_CAN1_TX_IRQHandler(void);
void WEAK USB_LP_CAN1_RX0_IRQHandler(void);
void WEAK CAN1_RX1_IRQHandler(void);
void WEAK CAN1_SCE_IRQHandler(void);
void WEAK EXTI9_5_IRQHandler(void);
void WEAK TIM1_BRK_IRQHandler(void);
void WEAK TIM1_UP_IRQHandler(void);
void WEAK TIM1_TRG_COM_IRQHandler(void);
void WEAK TIM1_CC_IRQHandler(void);
void WEAK TIM2_IRQHandler(void);
void WEAK TIM3_IRQHandler(void);
void WEAK TIM4_IRQHandler(void);
void WEAK I2C1_EV_IRQHandler(void);
void WEAK I2C1_ER_IRQHandler(void);
void WEAK I2C2_EV_IRQHandler(void);
void WEAK I2C2_ER_IRQHandler(void);
void WEAK SPI1_IRQHandler(void);
void WEAK SPI2_IRQHandler(void);
void WEAK USART1_IRQHandler(void);
void WEAK USART2_IRQHandler(void);
void WEAK USART3_IRQHandler(void);
void WEAK EXTI15_10_IRQHandler(void);
void WEAK RTCAlarm_IRQHandler(void);
void WEAK USBWakeUp_IRQHandler(void);
void WEAK TIM8_BRK_IRQHandler(void);
void WEAK TIM8_UP_IRQHandler(void);
void WEAK TIM8_TRG_COM_IRQHandler(void);
void WEAK TIM8_CC_IRQHandler(void);
void WEAK ADC3_IRQHandler(void);
void WEAK FSMC_IRQHandler(void);
void WEAK SDIO_IRQHandler(void);
void WEAK TIM5_IRQHandler(void);
void WEAK SPI3_IRQHandler(void);
void WEAK UART4_IRQHandler(void);
void WEAK UART5_IRQHandler(void);
void WEAK TIM6_IRQHandler(void);
void WEAK TIM7_IRQHandler(void);
void WEAK DMA2_Channel1_IRQHandler(void);
void WEAK DMA2_Channel2_IRQHandler(void);
void WEAK DMA2_Channel3_IRQHandler(void);
void WEAK DMA2_Channel4_5_IRQHandler(void);
void DMA2_Channel5_IRQHandler();
void ETH_IRQHandler();
void vMAC_ISR();
void ETH_WKUP_IRQHandler();
void CAN2_TX_IRQHandler();
void CAN2_RX0_IRQHandler();
void CAN2_RX1_IRQHandler();
void CAN2_SCE_IRQHandler();
void OTG_FS_IRQHandler();
void WEAK SystemInit_ExtMemCtl(void);


/* Exported types --------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
extern unsigned long _flash_data;
extern unsigned long _data;			/* start address for the .data section. defined in linker script */
extern unsigned long _edata;		/* end address for the .data section. defined in linker script */

extern unsigned long _bss;			/* start address for the .bss section. defined in linker script */
extern unsigned long _ebss;			/* end address for the .bss section. defined in linker script */

extern unsigned long _stack; /* start address for the .stack section. defined in linker script */
extern unsigned long _estack; /* end address for the .stack section. defined in linker script */


/* Private typedef -----------------------------------------------------------*/
/* function prototypes ------------------------------------------------------*/
void Reset_Handler(void) __attribute__((__interrupt__));
extern int main(void);
extern void SystemInit (void);
//extern void xPortPendSVHandler(void);
//extern void xPortSysTickHandler(void);
//extern void vTimer2IntHandler( void );
//extern void vPortSVCHandler( void );


/******************************************************************************
*
* The minimal vector table for a Cortex M3.  Note that the proper constructs
* must be placed on this to ensure that it ends up at physical address
* 0x0000.0000.
*
******************************************************************************/


__attribute__ ((section(".isr_vector")))
void (* const g_pfnVectors[])(void) =
{
  &_estack, 				  /* Top of stack address */
  Reset_Handler,              /* Reset Handler */
  NMI_Handler,                /* NMI Handler */
  HardFault_Handler,          /* Hard Fault Handler */
  MemManage_Handler,          /* MPU Fault Handler */
  BusFault_Handler,           /* Bus Fault Handler */
  UsageFault_Handler,         /* Usage Fault Handler */
  0,                          /* Reserved */
  0,                          /* Reserved */
  0,                          /* Reserved */
  0,                          /* Reserved */
  SVC_Handler,                /* SVCall Handler */
  DebugMon_Handler,           /* Debug Monitor Handler */
  0,                          /* Reserved */
  PendSV_Handler,             /* PendSV Handler */
  SysTick_Handler,            /* SysTick Handler */
  /* External Interrupts */
  WWDG_IRQHandler,            /* Window Watchdog */
  PVD_IRQHandler,             /* PVD through EXTI Line detect */
  TAMPER_IRQHandler,          /* Tamper */
  RTC_IRQHandler,             /* RTC */
  FLASH_IRQHandler,           /* Flash */
  RCC_IRQHandler,             /* RCC */
  EXTI0_IRQHandler,           /* EXTI Line 0 */
  EXTI1_IRQHandler,           /* EXTI Line 1 */
  EXTI2_IRQHandler,           /* EXTI Line 2 */
  EXTI3_IRQHandler,           /* EXTI Line 3 */
  EXTI4_IRQHandler,           /* EXTI Line 4 */
  DMA1_Channel1_IRQHandler,   /* DMA1 Channel 1 */
  DMA1_Channel2_IRQHandler,   /* DMA1 Channel 2 */
  DMA1_Channel3_IRQHandler,   /* DMA1 Channel 3 */
  DMA1_Channel4_IRQHandler,   /* DMA1 Channel 4 */
  DMA1_Channel5_IRQHandler,   /* DMA1 Channel 5 */
  DMA1_Channel6_IRQHandler,   /* DMA1 Channel 6 */
  DMA1_Channel7_IRQHandler,   /* DMA1 Channel 7 */
  ADC1_2_IRQHandler,          /* ADC1 & ADC2 */
  USB_HP_CAN1_TX_IRQHandler,  /* USB High Priority or CAN1 TX */
  USB_LP_CAN1_RX0_IRQHandler, /* USB Low  Priority or CAN1 RX0 */
  CAN1_RX1_IRQHandler,        /* CAN1 RX1 */
  CAN1_SCE_IRQHandler,        /* CAN1 SCE */
  EXTI9_5_IRQHandler,         /* EXTI Line 9..5 */
  TIM1_BRK_IRQHandler,        /* TIM1 Break */
  TIM1_UP_IRQHandler,         /* TIM1 Update */
  TIM1_TRG_COM_IRQHandler,    /* TIM1 Trigger and Commutation */
  TIM1_CC_IRQHandler,         /* TIM1 Capture Compare */
  TIM2_IRQHandler,            /* TIM2 */
  TIM3_IRQHandler,            /* TIM3 */
  TIM4_IRQHandler,            /* TIM4 */
  I2C1_EV_IRQHandler,         /* I2C1 Event */
  I2C1_ER_IRQHandler,         /* I2C1 Error */
  I2C2_EV_IRQHandler,         /* I2C2 Event */
  I2C2_ER_IRQHandler,         /* I2C2 Error */
  SPI1_IRQHandler,            /* SPI1 */
  SPI2_IRQHandler,            /* SPI2 */
  USART1_IRQHandler,          /* USART1 */
  USART2_IRQHandler,          /* USART2 */
  USART3_IRQHandler,          /* USART3 */
  EXTI15_10_IRQHandler,       /* EXTI Line 15..10 */
  RTCAlarm_IRQHandler,        /* RTC Alarm through EXTI Line */
  USBWakeUp_IRQHandler,       /* USB Wakeup from suspend */
  TIM8_BRK_IRQHandler,        /* TIM8 Break */
  TIM8_UP_IRQHandler,         /* TIM8 Update */
  TIM8_TRG_COM_IRQHandler,    /* TIM8 Trigger and Commutation */
  TIM8_CC_IRQHandler,         /* TIM8 Capture Compare */
  ADC3_IRQHandler,            /* ADC3 */
  FSMC_IRQHandler,            /* FSMC */
  SDIO_IRQHandler,            /* SDIO */
  TIM5_IRQHandler,            /* TIM5 */
  SPI3_IRQHandler,            /* SPI3 */
  UART4_IRQHandler,           /* UART4 */
  UART5_IRQHandler,           /* UART5 */
  TIM6_IRQHandler,            /* TIM6 */
  TIM7_IRQHandler,            /* TIM7 */
  DMA2_Channel1_IRQHandler,   /* DMA2 Channel 1 */
  DMA2_Channel2_IRQHandler,   /* DMA2 Channel 2 */
  DMA2_Channel3_IRQHandler,   /* DMA2 Channel 3 */
  DMA2_Channel4_5_IRQHandler, /* DMA2 Channel 4 and Channel 5 */
  DMA2_Channel5_IRQHandler,   /* Only for STM32 connectivity line devices */
//  ETH_IRQHandler,             /* Only for STM32 connectivity line devices */
  vMAC_ISR,             /* Only for STM32 connectivity line devices */
  ETH_WKUP_IRQHandler,        /* Only for STM32 connectivity line devices */
  CAN2_TX_IRQHandler,         /* Only for STM32 connectivity line devices */
  CAN2_RX0_IRQHandler,        /* Only for STM32 connectivity line devices */
  CAN2_RX1_IRQHandler,        /* Only for STM32 connectivity line devices */
  CAN2_SCE_IRQHandler,        /* Only for STM32 connectivity line devices */
  OTG_FS_IRQHandler,          /* Only for STM32 connectivity line devices */
  0,0,0,0,0,0,0,0,            /* @0x150 */
  0,0,0,0,0,0,0,0,            /* @0x170 */
  0,0,0,0,0,0,0,0,            /* @0x190 */
  0,0,0,0,0,0,0,0,            /* @0x1B0 */
  0,0,0,0,                    /* @0x1D0 */
  //(void *)0xF1E0F85F          /* @0x1E0. This is for boot in RAM mode for
};

/**
 * @brief  This is the code that gets called when the processor first
 *          starts execution following a reset event. Only the absolutely
 *          necessary set is performed, after which the application
 *          supplied main() routine is called.
 * @param  None
 * @retval : None
*/
void Reset_Handler(void)
{
    unsigned long *pulSrc, *pulDest;

    SystemInit();

    // Fill the stack with a known value.
    for(pulDest = &_stack; pulDest < &_estack; )
    {
    *pulDest++ = 0xA5A5;
    }

    // Copy the data segment initializers from flash to SRAM.
    pulSrc = &_flash_data;
    for(pulDest = &_data; pulDest < &_edata; )
    {
        *(pulDest++) = *(pulSrc++);
    }

    // Zero fill the bss segment.
    for(pulDest = &_bss; pulDest < &_ebss; )
    {
        *(pulDest++) = 0;
    }

    // Call the application's entry point.
    main();
}

/*******************************************************************************
*
* Provide weak aliases for each Exception handler to the Default_Handler.
* As they are weak aliases, any function with the same name will override
* this definition.
*
*******************************************************************************/
#pragma weak NMI_Handler = Default_Handler
#pragma weak MemManage_Handler = Default_Handler
#pragma weak BusFault_Handler = Default_Handler
#pragma weak UsageFault_Handler = Default_Handler
#pragma weak SVC_Handler = Default_Handler
#pragma weak DebugMon_Handler = Default_Handler
#pragma weak PendSV_Handler = Default_Handler
#pragma weak SysTick_Handler = Default_Handler
#pragma weak WWDG_IRQHandler = Default_Handler
#pragma weak PVD_IRQHandler = Default_Handler
#pragma weak TAMPER_IRQHandler = Default_Handler
#pragma weak RTC_IRQHandler = Default_Handler
#pragma weak FLASH_IRQHandler = Default_Handler
#pragma weak RCC_IRQHandler = Default_Handler
#pragma weak EXTI0_IRQHandler = Default_Handler
#pragma weak EXTI1_IRQHandler = Default_Handler
#pragma weak EXTI2_IRQHandler = Default_Handler
#pragma weak EXTI3_IRQHandler = Default_Handler
#pragma weak EXTI4_IRQHandler = Default_Handler
#pragma weak DMA1_Channel1_IRQHandler = Default_Handler
#pragma weak DMA1_Channel2_IRQHandler = Default_Handler
#pragma weak DMA1_Channel3_IRQHandler = Default_Handler
#pragma weak DMA1_Channel4_IRQHandler = Default_Handler
#pragma weak DMA1_Channel5_IRQHandler = Default_Handler
#pragma weak DMA1_Channel6_IRQHandler = Default_Handler
#pragma weak DMA1_Channel7_IRQHandler = Default_Handler
#pragma weak ADC1_2_IRQHandler = Default_Handler
#pragma weak USB_HP_CAN1_TX_IRQHandler = Default_Handler
#pragma weak USB_LP_CAN1_RX0_IRQHandler = Default_Handler
#pragma weak CAN1_RX1_IRQHandler = Default_Handler
#pragma weak CAN1_SCE_IRQHandler = Default_Handler
#pragma weak EXTI9_5_IRQHandler = Default_Handler
#pragma weak TIM1_BRK_IRQHandler = Default_Handler
#pragma weak TIM1_UP_IRQHandler = Default_Handler
#pragma weak TIM1_TRG_COM_IRQHandler = Default_Handler
#pragma weak TIM1_CC_IRQHandler = Default_Handler
#pragma weak TIM2_IRQHandler = Default_Handler
#pragma weak TIM3_IRQHandler = Default_Handler
#pragma weak TIM4_IRQHandler = Default_Handler
#pragma weak I2C1_EV_IRQHandler = Default_Handler
#pragma weak I2C1_ER_IRQHandler = Default_Handler
#pragma weak I2C2_EV_IRQHandler = Default_Handler
#pragma weak I2C2_ER_IRQHandler = Default_Handler
#pragma weak SPI1_IRQHandler = Default_Handler
#pragma weak SPI2_IRQHandler = Default_Handler
#pragma weak USART1_IRQHandler = Default_Handler
#pragma weak USART2_IRQHandler = Default_Handler
#pragma weak USART3_IRQHandler = Default_Handler
#pragma weak EXTI15_10_IRQHandler = Default_Handler
#pragma weak RTCAlarm_IRQHandler = Default_Handler
#pragma weak USBWakeUp_IRQHandler = Default_Handler
#pragma weak TIM8_BRK_IRQHandler = Default_Handler
#pragma weak TIM8_UP_IRQHandler = Default_Handler
#pragma weak TIM8_TRG_COM_IRQHandler = Default_Handler
#pragma weak TIM8_CC_IRQHandler = Default_Handler
#pragma weak ADC3_IRQHandler = Default_Handler
#pragma weak FSMC_IRQHandler = Default_Handler
#pragma weak SDIO_IRQHandler = Default_Handler
#pragma weak TIM5_IRQHandler = Default_Handler
#pragma weak SPI3_IRQHandler = Default_Handler
#pragma weak UART4_IRQHandler = Default_Handler
#pragma weak UART5_IRQHandler = Default_Handler
#pragma weak TIM6_IRQHandler = Default_Handler
#pragma weak TIM7_IRQHandler = Default_Handler
#pragma weak DMA2_Channel1_IRQHandler = Default_Handler
#pragma weak DMA2_Channel2_IRQHandler = Default_Handler
#pragma weak DMA2_Channel3_IRQHandler = Default_Handler
#pragma weak DMA2_Channel4_5_IRQHandler = Default_Handler
#pragma weak DMA2_Channel5_IRQHandler = Default_Handler
#pragma weak ETH_IRQHandler = Default_Handler
#pragma weak ETH_WKUP_IRQHandler = Default_Handler
#pragma weak CAN2_TX_IRQHandler = Default_Handler
#pragma weak CAN2_RX0_IRQHandler = Default_Handler
#pragma weak CAN2_RX1_IRQHandler = Default_Handler
#pragma weak CAN2_SCE_IRQHandler = Default_Handler
#pragma weak OTG_FS_IRQHandler = Default_Handler
#pragma weak vMAC_ISR = Default_Handler
void WEAK SystemInit_ExtMemCtl(void);

#pragma weak SystemInit_ExtMemCtl = SystemInit_ExtMemCtl_Dummy

/**
 * @brief  This is the code that gets called when the processor receives an
 *         unexpected interrupt.  This simply enters an infinite loop, preserving
 *         the system state for examination by a debugger.
 *
 * @param  None
 * @retval : None
*/

void Default_Handler(void)
{
  /* Go into an infinite loop. */
  while (1)
  {
  }
}

/**
 * @brief  Dummy SystemInit_ExtMemCtl function
 * @param  None
 * @retval : None
*/

void SystemInit_ExtMemCtl_Dummy(void)
{
}


/********************* (C) COPYRIGHT 2007 STMicroelectronics  *****END OF FILE****/


